Revit 2027 API
ExternalDataManagerDataItem.GetId Method
 Gets the id of the data item.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ExternalDataManagerDataItemId GetId()
Public Function GetId As ExternalDataManagerDataItemId
public:
ExternalDataManagerDataItemId^ GetId()
member GetId : unit -> ExternalDataManagerDataItemId
Return Value
ExternalDataManagerDataItemId
See Also
Reference
ExternalDataManagerDataItem Class
Autodesk.Revit.UI Namespace